module.exports = {
	// максимальная длина стоки
	printWidth: 80,
	// размер оступа tab
	tabWidth: 2,
	// использовать tab вместо пробелов
	useTabs: false,
	// добавляет точку с запятой в конце выражения
	semi: true,
	// использовать одинарные ковычки
	singleQuote: true,
	// использовать одинарные ковычки в jsx
	jsxSingleQuote: false,
	// символ > в многострочных JSX-элементах будет помещён в последней строке
	bracketSameLine: false,
	// пробел между телом объекта и фигурными скобками в объектных литералах
	bracketSpacing: true,
	// наличие запятой после последнего свойства объекта
	trailingComma: 'all',
	// включите круглые скобки вокруг единственного параметра в стрелочной функции
	arrowParens: 'always',
	// конец строки
	endOfLine: 'lf',
};
